OpenFOAM-v2106/tutorials/multiphase/overInterDyMFoam/floatingBodyWithSpring/background/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(stationaryWalls|sidePatch)"
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    floatingObject
    {
        type            zeroGradient;
    }

    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    sides
    {
        patchType       overset;
        type            zeroGradient;
    }
}


// ************************************************************************* //
